Revit 2027 API
ParameterTypeId.LightingFixtureWattage Property
 "Wattage Comments"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId LightingFixtureWattage { get; }
Public Shared ReadOnly Property LightingFixtureWattage As ForgeTypeId
	Get
public:
static property ForgeTypeId^ LightingFixtureWattage {
	ForgeTypeId^ get ();
}
static member LightingFixtureWattage : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace